{
  "backend/main.mo": "Motoko canister handling user profile CRUD with authorization mixins and storing booking inquiries with submission and filtered retrieval APIs.",
  "feature_evidence.json": "Feature evidence listing two inquiry‑filtering and search enhancements, mapping them to affected frontend files and components.",
  "frontend-file-summaries.txt": "Collection of short summaries describing responsibilities of various frontend components, hooks, and config files.",
  "frontend/index.css": "Tailwind base and theme definitions configuring color tokens, dark mode variables, and global element styling.",
  "frontend/index.html": "HTML entry point defining metadata, Google Fonts links, and loading the React app root script.",
  "frontend/PRODUCTION_PROMOTION.md": "Runbook outlining prerequisites, checks, and steps to promote the build to production on the Internet Computer.",
  "frontend/src/App.tsx": "Main React app wiring sections of the site and conditionally rendering the bookings admin section when authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button using Internet Identity to log in or out and clear React Query cache on logout.",
  "frontend/src/components/portfolio/LightboxModal.tsx": "Keyboard‑navigable lightbox modal with focus trap, scroll lock, and previous/next image controls.",
  "frontend/src/components/portfolio/PortfolioFilters.tsx": "Simple category filter component rendering selectable buttons including an All option.",
  "frontend/src/components/sections/AboutSection.tsx": "Displays an About section with studio description, stats, and a featured image.",
  "frontend/src/components/sections/BookingsSection.tsx": "Implements inquiry management with filtering, search, and service-type selection using query hooks.",
  "frontend/src/components/sections/ContactSection.tsx": "Provides a contact form with validation, inquiry submission, and contact info display.",
  "frontend/src/components/sections/HeroSection.tsx": "Renders a hero banner with background image, title, tagline, and CTA buttons.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Shows filterable portfolio items with category selection and a lightbox for viewing images.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists available photography services with icons, titles, and descriptions.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Displays a grid of hardcoded client testimonials with ratings and styled cards.",
  "frontend/src/components/site/Footer.tsx": "Renders the site footer with branding, quick links, contact info, and social icons.",
  "frontend/src/components/site/Header.tsx": "Provides a responsive header with navigation, login button, scroll behavior, and optional authenticated links.",
  "frontend/src/config/contactInfo.ts": "Exports centralized contact details including phones, email, address, and hours.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useBodyScrollLock.ts": "Locks body scrolling when enabled and restores original styles on cleanup.",
  "frontend/src/hooks/useFocusTrap.ts": "Traps keyboard focus within a container when active, restoring previous focus on exit.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for handling Internet Identity auth, login state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profile, submitting and retrieving inquiries, and checking admin status using the actor API.",
  "frontend/src/index.css": "Tailwind base styles plus custom OKLCH color variables, typography, and dark mode theme definitions.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider and loads global styles.",
  "frontend/src/utils/inquiry.ts": "Defines service type labels and simple validators for email, required fields, and phone numbers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, spacing, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, known features, and current state for the inquiries admin UX update."
}