{
  "backend/main.mo": "Main canister logic handling access control, user profiles, inquiries, search events, feedback, and behavior tracking with permission-checked query and update methods.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding empty feedback and behavior-tracking structures.",
  "feature_evidence.json": "Feature mapping file listing frontend files, components, and tests associated with feedback, analytics, and behavior-tracking features.",
  "frontend-file-summaries.txt": "Text file containing prewritten one-line summaries for all frontend components and utilities.",
  "frontend/index.css": "Tailwind base/theme definitions with OKLCH color variables, dark mode tokens, and global background/foreground styles.",
  "frontend/index.html": "HTML entry point setting document metadata, fonts, and mounting root element for the frontend app.",
  "frontend/PRODUCTION_PROMOTION.md": "Runbook detailing prerequisites, checks, and steps for promoting the build to the production IC environment.",
  "frontend/src/App.tsx": "Top-level React component composing all site sections, handling navigation scroll logic, and recording behavior events.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with React Query cache clearing and loading states.",
  "frontend/src/components/portfolio/LightboxModal.tsx": "Displays a fullscreen modal with image navigation, keyboard controls, and focus/scroll locking for portfolio images.",
  "frontend/src/components/portfolio/PortfolioFilters.tsx": "Renders category filter buttons allowing users to select and change the active portfolio filter.",
  "frontend/src/components/sections/AboutSection.tsx": "Shows an about section with studio description, stats, and an accompanying image.",
  "frontend/src/components/sections/BehaviorAnalyticsSection.tsx": "Admin-only dashboard section that fetches and displays recent and top behavior events with refresh and error states.",
  "frontend/src/components/sections/BookingsSection.tsx": "Displays customer inquiries with search, service-type filtering, loading states, and refresh controls.",
  "frontend/src/components/sections/ContactSection.tsx": "Provides a contact form with validation and inquiry submission plus contact info display.",
  "frontend/src/components/sections/FeedbackReviewSection.tsx": "Admin-only panel that fetches, filters, sorts, and displays user feedback with search and refresh controls.",
  "frontend/src/components/sections/FeedbackSection.tsx": "User form for submitting star ratings and optional feedback with validation and success handling.",
  "frontend/src/components/sections/HeroSection.tsx": "Landing hero with CTA buttons that record behavior events and trigger booking or scrolling actions.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Portfolio viewer with category filtering, item highlighting, lightbox navigation, and click event tracking.",
  "frontend/src/components/sections/SearchAnalyticsSection.tsx": "Admin-only dashboard showing top search queries and recent search events with refresh and error states.",
  "frontend/src/components/sections/ServicesSection.tsx": "Displays a grid of photography services with icons, titles, and descriptions.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Renders a testimonials grid with client quotes, ratings, and styling details.",
  "frontend/src/components/site/Footer.tsx": "Displays site footer with branding, quick links, contact info, and social icons.",
  "frontend/src/components/site/Header.tsx": "Implements a dynamic header with navigation, search, auth-aware links, and behavior tracking.",
  "frontend/src/components/site/SiteSearch.tsx": "Provides a searchable input with debounced analytics, result dropdown, and navigation callbacks.",
  "frontend/src/config/contactInfo.ts": "Exports centralized contact details including phones, emails, address, and hours.",
  "frontend/src/content/siteContent.ts": "Defines searchable site content for services, portfolio items, and sections used in site-wide search.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useBodyScrollLock.ts": "Hook that locks body scrolling when active and restores original styles on cleanup.",
  "frontend/src/hooks/useFocusTrap.ts": "Implements a React hook that traps keyboard focus within an active container, restoring prior focus on cleanup.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context using Internet Identity, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for user profiles, inquiries, admin checks, and analytics operations.",
  "frontend/src/index.css": "Defines Tailwind base layers, custom CSS variables, themes, and typography for the app’s styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/behaviorTracking.ts": "Defines behavior event constants and helpers for serializing and parsing analytics event details.",
  "frontend/src/utils/inquiry.ts": "Provides service-type options, label lookup, and basic validators for email, required fields, and phone numbers.",
  "frontend/src/utils/siteSearch.ts": "Implements case‑insensitive search across services, portfolio items, and site sections.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session‑stored parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended theme settings, custom colors, animations, spacing, and plugin usage.",
  "project_state.json": "Defines the project's state, existing features, and pending feature requests for customer data collection, feedback, and behavior tracking."
}